Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPsi5s_bf.h
/** \brief Mask for Ifx_PSI5S_TSCNTA_Bits.TBEA */
#define IFX_PSI5S_TSCNTA_TBEA_MSK (0x1u)

/** \brief Offset for Ifx_PSI5S_TSCNTA_Bits.TBEA */
#define IFX_PSI5S_TSCNTA_TBEA_OFF (28u)

/** \brief Length for Ifx_PSI5S_TSCNTA_Bits.TBEB */
#define IFX_PSI5S_TSCNTA_TBEB_LEN (1u)

/** \brief Mask for Ifx_PSI5S_TSCNTA_Bits.TBEB */
#define IFX_PSI5S_TSCNTA_TBEB_MSK (0x1u)

/** \brief Offset for Ifx_PSI5S_TSCNTA_Bits.TBEB */
#define IFX_PSI5S_TSCNTA_TBEB_OFF (29u)

/** \brief Length for Ifx_PSI5S_TSCNTA_Bits.CLRA */
#define IFX_PSI5S_TSCNTA_CLRA_LEN (1u)

/** \brief Mask for Ifx_PSI5S_TSCNTA_Bits.CLRA */
#define IFX_PSI5S_TSCNTA_CLRA_MSK (0x1u)

/** \brief Offset for Ifx_PSI5S_TSCNTA_Bits.CLRA */
#define IFX_PSI5S_TSCNTA_CLRA_OFF (30u)

/** \brief Length for Ifx_PSI5S_TSCNTA_Bits.CLRB */
#define IFX_PSI5S_TSCNTA_CLRB_LEN (1u)

/** \brief Mask for Ifx_PSI5S_TSCNTA_Bits.CLRB */
#define IFX_PSI5S_TSCNTA_CLRB_MSK (0x1u)

/** \brief Offset for Ifx_PSI5S_TSCNTA_Bits.CLRB */
#define IFX_PSI5S_TSCNTA_CLRB_OFF (31u)

/** \brief Length for Ifx_PSI5S_TSCNTB_Bits.CTS */
#define IFX_PSI5S_TSCNTB_CTS_LEN (24u)

/** \brief Mask for Ifx_PSI5S_TSCNTB_Bits.CTS */
#define IFX_PSI5S_TSCNTB_CTS_MSK (0xffffffu)

/** \brief Offset for Ifx_PSI5S_TSCNTB_Bits.CTS */
#define IFX_PSI5S_TSCNTB_CTS_OFF (0u)

/** \brief Length for Ifx_PSI5S_TSCNTB_Bits.ETB */
#define IFX_PSI5S_TSCNTB_ETB_LEN (3u)

/** \brief Mask for Ifx_PSI5S_TSCNTB_Bits.ETB */
#define IFX_PSI5S_TSCNTB_ETB_MSK (0x7u)

/** \brief Offset for Ifx_PSI5S_TSCNTB_Bits.ETB */
#define IFX_PSI5S_TSCNTB_ETB_OFF (24u)

/** \brief Length for Ifx_PSI5S_TSCNTB_Bits.TBS */
#define IFX_PSI5S_TSCNTB_TBS_LEN (1u)

/** \brief Mask for Ifx_PSI5S_TSCNTB_Bits.TBS */
#define IFX_PSI5S_TSCNTB_TBS_MSK (0x1u)

/** \brief Offset for Ifx_PSI5S_TSCNTB_Bits.TBS */
#define IFX_PSI5S_TSCNTB_TBS_OFF (27u)

/** \brief Length for Ifx_PSI5S_GCR_Bits.CRCI */
#define IFX_PSI5S_GCR_CRCI_LEN (1u)

/** \brief Mask for Ifx_PSI5S_GCR_Bits.CRCI */
#define IFX_PSI5S_GCR_CRCI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5S_GCR_Bits.CRCI */
#define IFX_PSI5S_GCR_CRCI_OFF (0u)

/** \brief Length for Ifx_PSI5S_GCR_Bits.XCRCI */
#define IFX_PSI5S_GCR_XCRCI_LEN (1u)

/** \brief Mask for Ifx_PSI5S_GCR_Bits.XCRCI */
#define IFX_PSI5S_GCR_XCRCI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5S_GCR_Bits.XCRCI */
#define IFX_PSI5S_GCR_XCRCI_OFF (1u)

/** \brief Length for Ifx_PSI5S_GCR_Bits.TEI */
#define IFX_PSI5S_GCR_TEI_LEN (1u)

/** \brief Mask for Ifx_PSI5S_GCR_Bits.TEI */
#define IFX_PSI5S_GCR_TEI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5S_GCR_Bits.TEI */
#define IFX_PSI5S_GCR_TEI_OFF (2u)

/** \brief Length for Ifx_PSI5S_GCR_Bits.PE */
#define IFX_PSI5S_GCR_PE_LEN (1u)

/** \brief Mask for Ifx_PSI5S_GCR_Bits.PE */
#define IFX_PSI5S_GCR_PE_MSK (0x1u)

/** \brief Offset for Ifx_PSI5S_GCR_Bits.PE */
#define IFX_PSI5S_GCR_PE_OFF (3u)

/** \brief Length for Ifx_PSI5S_GCR_Bits.FE */
#define IFX_PSI5S_GCR_FE_LEN (1u)

/** \brief Mask for Ifx_PSI5S_GCR_Bits.FE */
#define IFX_PSI5S_GCR_FE_MSK (0x1u)

/** \brief Offset for Ifx_PSI5S_GCR_Bits.FE */
#define IFX_PSI5S_GCR_FE_OFF (4u)

/** \brief Length for Ifx_PSI5S_GCR_Bits.OE */
#define IFX_PSI5S_GCR_OE_LEN (1u)

/** \brief Mask for Ifx_PSI5S_GCR_Bits.OE */
#define IFX_PSI5S_GCR_OE_MSK (0x1u)

/** \brief Offset for Ifx_PSI5S_GCR_Bits.OE */
#define IFX_PSI5S_GCR_OE_OFF (5u)

/** \brief Length for Ifx_PSI5S_GCR_Bits.RBI */
#define IFX_PSI5S_GCR_RBI_LEN (1u)

/** \brief Mask for Ifx_PSI5S_GCR_Bits.RBI */
#define IFX_PSI5S_GCR_RBI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5S_GCR_Bits.RBI */
#define IFX_PSI5S_GCR_RBI_OFF (6u)

/** \brief Length for Ifx_PSI5S_GCR_Bits.HDI */
#define IFX_PSI5S_GCR_HDI_LEN (1u)

/** \brief Mask for Ifx_PSI5S_GCR_Bits.HDI */
#define IFX_PSI5S_GCR_HDI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5S_GCR_Bits.HDI */
#define IFX_PSI5S_GCR_HDI_OFF (7u)

/** \brief Length for Ifx_PSI5S_GCR_Bits.ETC0 */
#define IFX_PSI5S_GCR_ETC0_LEN (1u)

/** \brief Mask for Ifx_PSI5S_GCR_Bits.ETC0 */
#define IFX_PSI5S_GCR_ETC0_MSK (0x1u)

/** \brief Offset for Ifx_PSI5S_GCR_Bits.ETC0 */
#define IFX_PSI5S_GCR_ETC0_OFF (8u)

/** \brief Length for Ifx_PSI5S_GCR_Bits.ETC1 */
#define IFX_PSI5S_GCR_ETC1_LEN (1u)

/** \brief Mask for Ifx_PSI5S_GCR_Bits.ETC1 */
#define IFX_PSI5S_GCR_ETC1_MSK (0x1u)

/** \brief Offset for Ifx_PSI5S_GCR_Bits.ETC1 */
#define IFX_PSI5S_GCR_ETC1_OFF (9u)

/** \brief Length for Ifx_PSI5S_GCR_Bits.ETC2 */
#define IFX_PSI5S_GCR_ETC2_LEN (1u)

/** \brief Mask for Ifx_PSI5S_GCR_Bits.ETC2 */
#define IFX_PSI5S_GCR_ETC2_MSK (0x1u)

/** \brief Offset for Ifx_PSI5S_GCR_Bits.ETC2 */
#define IFX_PSI5S_GCR_ETC2_OFF (10u)

/** \brief Length for Ifx_PSI5S_GCR_Bits.ETC3 */
#define IFX_PSI5S_GCR_ETC3_LEN (1u)

/** \brief Mask for Ifx_PSI5S_GCR_Bits.ETC3 */
#define IFX_PSI5S_GCR_ETC3_MSK (0x1u)

/** \brief Offset for Ifx_PSI5S_GCR_Bits.ETC3 */
#define IFX_PSI5S_GCR_ETC3_OFF (11u)

/** \brief Length for Ifx_PSI5S_GCR_Bits.ETC4 */
#define IFX_PSI5S_GCR_ETC4_LEN (1u)

/** \brief Mask for Ifx_PSI5S_GCR_Bits.ETC4 */
#define IFX_PSI5S_GCR_ETC4_MSK (0x1u)

/** \brief Offset for Ifx_PSI5S_GCR_Bits.ETC4 */
#define IFX_PSI5S_GCR_ETC4_OFF (12u)

/** \brief Length for Ifx_PSI5S_GCR_Bits.ETC5 */
#define IFX_PSI5S_GCR_ETC5_LEN (1u)

/** \brief Mask for Ifx_PSI5S_GCR_Bits.ETC5 */
#define IFX_PSI5S_GCR_ETC5_MSK (0x1u)

/** \brief Offset for Ifx_PSI5S_GCR_Bits.ETC5 */
#define IFX_PSI5S_GCR_ETC5_OFF (13u)

/** \brief Length for Ifx_PSI5S_GCR_Bits.ETC6 */
#define IFX_PSI5S_GCR_ETC6_LEN (1u)

/** \brief Mask for Ifx_PSI5S_GCR_Bits.ETC6 */
#define IFX_PSI5S_GCR_ETC6_MSK (0x1u)

/** \brief Offset for Ifx_PSI5S_GCR_Bits.ETC6 */
#define IFX_PSI5S_GCR_ETC6_OFF (14u)

/** \brief Length for Ifx_PSI5S_GCR_Bits.ETC7 */
#define IFX_PSI5S_GCR_ETC7_LEN (1u)

/** \brief Mask for Ifx_PSI5S_GCR_Bits.ETC7 */
#define IFX_PSI5S_GCR_ETC7_MSK (0x1u)

/** \brief Offset for Ifx_PSI5S_GCR_Bits.ETC7 */
#define IFX_PSI5S_GCR_ETC7_OFF (15u)

/** \brief Length for Ifx_PSI5S_GCR_Bits.CEN0 */
#define IFX_PSI5S_GCR_CEN0_LEN (1u)

/** \brief Mask for Ifx_PSI5S_GCR_Bits.CEN0 */
#define IFX_PSI5S_GCR_CEN0_MSK (0x1u)

/** \brief Offset for Ifx_PSI5S_GCR_Bits.CEN0 */
#define IFX_PSI5S_GCR_CEN0_OFF (16u)

/** \brief Length for Ifx_PSI5S_GCR_Bits.CEN1 */
#define IFX_PSI5S_GCR_CEN1_LEN (1u)

